//#include <stdio.h>
//
//int main(void) {
//	int a = 3;
//	int b = 7;
//
//	int c = a + b;	// 10
//	int d = c - a;	// 7
//
//	if (a < b) {	// 조건문이 참이면,
//		printf("a가 b보다 작습니다.");
//	} else {	// 조건문이 거짓이면
//		printf("a가 b보다 큽니다.");
//	}
//
//	return 0;
//}
//
//// Mac (맥북) Visual Studio Code 
//// + C, C++
//
///*
//	int num 입력 받으시고, // scanf_s
//	num이 짝수면, "짝수입니다."
//	2, 4, 6, 8, 10, 100, 222, 420, ...
//	= 2로 나눠진다
//	= 2로 나누면 나머지가 0
//	num이 홀수면, "홀수입니다."
//	1, 7, 11, 13, ..., 1117 ... 
//	= 2로 나눠도 딱 떨어지지 않죠
//	= 2로 나누면 나머지가 1
//
//	+, -, *, /, %, ==, >=, <=, >, <
//*/